{
  "paper_id": "13",
  "paper_title": "Daily auditory environments in French-speaking infants: A longitudinal dataset",
  "sections": [
    {
      "section": "FrontMatter",
      "chunks": [
        "Proceedings of the Workshop on Cognitive Modeling and Computational Linguistics, pages 132–151 August 15, 2024 ©2024 Association for Computational Linguistics Daily auditory environments in French-speaking infants: A longitudinal dataset Estelle Hervé CNRS & Aix Marseille Univ Laboratoire Parole et Langage Aix-en-Provence, France estelle.herve@univ-amu.fr Clément François CNRS & Aix Marseille Univ Laboratoire Parole et Langage Aix-en-Provence, France clement.francois@cnrs.fr Laurent Prévot CNRS & MEAE CEFC Taipei, Taiwan laurent.prevot@cnrs.fr"
      ]
    },
    {
      "section": "Abstract",
      "chunks": [
        "Babies’ daily auditory environment plays a crucial role in language development. Most previous research estimating the quantitative and qualitative aspects of early speech inputs has predominantly focused on English- and Spanish-speaking families. In addition, validation studies for daylong recordings’ analysis tools are scarce on French data sets. In this paper, we present a French corpus of daylong audio recordings longitudinally collected with the LENA (Language ENvironment Analysis) system from infants aged 3 to 24 months. We conduct a thorough exploration of this data set, which serves as a quality check for both the data and the analysis tools. We evaluate the reliability of LENA metrics by systematically comparing them with those obtained from the ChildProject set of tools and checking the known dynamics of the metrics with age. These metrics are also used to replicate, on our data set, findings from Warlaumont et al. (2014) about the increase of infants’ speech vocalizations and temporal contingencies between infants and caregivers with age. 1"
      ]
    },
    {
      "section": "Introduction",
      "chunks": [
        "Infants rely on their daily auditory environment to develop language and other cognitive skills. Pioneering studies interested in these early auditory inputs used observatory experiments in laboratory settings or short recordings that were manually annotated (Hart and Risley, 1992; Keller et al., 2004). In the last decades, technological advances brought new tools that allowed the collection and analysis of more considerable and ecological datasets. Daylong recordings are now increasingly used in developmental studies (Ganek and Eriks-Brophy, 2018; Bergelson et al., 2023), especially since the release of the Language Environment Analysis (LENA) system in 2004. Daily auditory environments have been described in a variety of populations (Christakis et al., 2009; Aragon and Yoshinaga-Itano, 2012; Caskey et al., 2014; Warren et al., 2010), highlighting the positive effects of early caregiver-infant interactions on language development (Warlaumont et al., 2014; Gilkerson and Richards, 2008; Bergelson and Aslin, 2017). Nonetheless, only two datasets were collected in French-speaking households (Canault et al., 2016; Orena et al., 2019). Here, we expand the literature by describing an original dataset of infants’ daylong audio recordings gathered in twenty French-speaking families. We focused on 3-to-24-month-old babies for several reasons: (1) it allows a direct comparison with Canault et al. (2016)’s and Warlaumont et al. (2014) results ; (2) it includes crucial steps for language development, including the emergence of phonemic categories between 6 and 10 months (Werker and Tees, 1984; Cheour et al., 1998), and the vocabulary spurt between 18 and 24 months (Benedict, 1979; Goldfield and Reznick, 1990; Nazzi and Bertoncini, 2003) ; (3) the two first years of life constitute a critical period where caregiver-infant interactions are early precursors of later language outcomes and cognitive skills (Warlaumont et al., 2022; Gilkerson and Richards, 2009; Weisleder and Fernald, 2013; Bergelson and Aslin, 2017). LENA’s output correlation with human annotations has been assessed in several languages, suggesting good reliability (Xu et al., 2008b; Weisleder and Fernald, 2013; Gilkerson et al., 2015; Busch et al., 2018; Pae et al., 2016; Ganek and Eriks-Brophy, 2017). However, only one study provided evidence for LENA system reliability in European French, yielding relatively good results (Canault et al., 2016). Moreover, LENA validation studies implied listening to the continuous raw audio recordings. In addition to being highly time-consuming, this approach raises critical ethical issues associated with data privacy (Casillas and Cristia, 2019; Cychosz et al., 2020). Here, we override these difficulties by comparing the LENA metrics outputs with other 132 annotation systems.",
        "The paper has the following contributions: (i) describe a new French corpus of auditory LENArecorded data, (ii) compare different automatic annotation tools, (iii) provide a picture of the daily auditory environment in French-speaking families in 3-to-24-months infants, (iv) show the potential of the data set by replicating daylong recordingsbased results on developmental trajectories. 2"
      ]
    },
    {
      "section": "Related Work",
      "chunks": [
        "This section is a brief overview of the existing literature regarding daylong recording studies in developmental populations. We identified two main types of studies: (i) experimental studies that used daylong recordings as a tool to answer a specific research question and (ii) validation studies that focused on assessing the reliability of the recording and analysis tools themselves. 2.1 Experimental studies Daylong recording studies in infants often involved the LENA system. Four years after its release, the first LENA normative study, the “Natural Language Study (NLS)” was conducted by the LENA Research Foundation (Gilkerson and Richards, 2008). This report relied on the three main LENA metrics (Adult Word Count: AWC; Child Vocalization Count: CVC; Conversational Turn Counts: CTC) to describe daily auditory environments in"
      ]
    },
    {
      "section": "329 English-speaking infants aged 2 to 48 months.",
      "chunks": [
        "Then, more experimental works involving daylong recordings in infants began to emerge (see Ganek and Eriks-Brophy (2018) for a review). Studies that focused on the characteristics of the daily auditory environment in typically developing infants revealed that children’s vocalizations and child-caregiver interactions increased with age within the first two years of life (Gilkerson and Richards, 2008; Pae et al., 2016). Warlaumont et al. (2014) proposed a \"social feedback loop\" in which contingencies between adult-child and child-adult speech-like vocalizations contribute to increasing interactions between infants and adults through age. Additionally, a higher proportion of adultchild interactions has been associated with larger vocabulary size (Weisleder and Fernald, 2013). The impact of various factors like multilingualism (Oller et al., 2010; Orena et al., 2019; Ramírez and Hippe, 2024), socio-economic status (Bergelson et al., 2023), exposure to TV Christakis et al. (2009); Zimmerman et al. (2009), musical inputs (Mendoza and Fausey, 2021), activity during the day (Soderstrom and Wittebolle, 2013) and temporal dynamics of the surrounding sounds (Warlaumont et al., 2022) have been investigated as well. Daylong recording studies in clinical populations showed the importance of understanding infants’ daily soundscape for early language intervention (Caskey et al., 2011; Warren et al., 2010; Warlaumont et al., 2014; Aragon and Yoshinaga-Itano, 2012). Overall, age ranges, sample sizes, and recording spans varied across studies. Some infants were included as early as 2 months of age (Aragon and Yoshinaga-Itano, 2012; Bergelson and Aslin, 2017; Zimmerman et al., 2009), while others started after"
      ]
    },
    {
      "section": "12 months of age (Oller et al., 2010; Warren et al.,",
      "chunks": [
        "2010; Weisleder and Fernald, 2013). Children could be followed longitudinally within various periods (Gilkerson et al., 2018; Sy et al., 2023) but not systematically (Weisleder and Fernald, 2013; Bergelson and Aslin, 2017). Although most studies relied on the LENA system, methodological choices regarding data collection and analysis were various. For example, some authors chose to rely on preexisting datasets that already fitted their research questions (Christakis et al., 2009; Aragon and Yoshinaga-Itano, 2012; Warren et al., 2010). For data analysis, the LENA metrics were mostly used although some preferred to develop their own tools (MacWhinney, 2000; Al Futaisi et al., 2019; Lavechin et al., 2020; Räsänen et al., 2021). 2.2 Validation studies The first LENA validation study was led in 2008 on American English, as part of the NLS (Xu et al., 2008b). Human annotations were compared with automatic outputs provided by the LENA software to determine agreement scores, measured with Pearson’s correlations. LENA’s AWC and CVC reached r = 0.82 and r = 0.76 respectively, indicating reliable LENA annotations for subsequent Englishspeaking environment studies (Christakis et al., 2009; Warren et al., 2010; Xu et al., 2008a; Zimmerman et al., 2009; Gilkerson et al., 2017). Later, the same validation procedure was applied to other languages, focusing on the three main LENA metrics (AWC, CVC, and CTC). Overall, the AWC metric was the most reliable, although several authors reported that, on average, 133 the LENA’s estimations were lower than the human counts (Xu et al., 2009; Canault et al., 2016). Agreement scores for AWC were reported in Spanish (r = 0.80, Weisleder and Fernald (2013)), Mandarin (r = 0.72, Gilkerson et al. (2015)), Korean (r = 0.72, Pae et al. (2016)), and Dutch (r = 0.87, Busch et al. (2018)). CVC and CTC’s reliability were not systematically assessed and yielded variable results, ranging from r = 0.52 (Busch et al., 2018) to r = 0.84 (Gilkerson and Richards, 2008) (see Table 3 in Appendices). In French, we found Canault et al. (2016)’s report as the only existing validation study so far. They manually annotated and transcribed 324 ten-minute samples recorded in 3-to-48-month-olds: Pearson’s correlation scores were r = 0.64 for AWC and r = 0.71 for CVC. These results suggest good reliability for LENA metrics in French, although slightly below the abovementioned languages. Cristia et al. (2021)’s comprehensive validation study in three different linguistic and socio-cultural environments calls for more validation studies with more detailed and systematic methods. However, the concurrent emergence of annotation tools (MacWhinney, 2000; Al Futaisi et al., 2019; Lavechin et al., 2020; Räsänen et al., 2021) tends to increase methodological variability. To converge toward a standardized pipeline for daylong data management, Gautheron et al. (2023) developed the ChildProject package.",
        "It is compatible with many existing annotation formats and allows annotation systems comparisons. Here, we relied on these tools to compare LENA’s metrics with measures extracted from the Voice Type Classifier (VTC) from Lavechin et al. (2020) and the VoCalisation Maturity analysis (VCM) from Al Futaisi et al. (2019). 3 Rationale 3.1 Participants Infants were recruited between 3 and 18 months of age in three daycare centers in south-east France. An official collaboration between our team and the daycare centers was established to facilitate both participants’ recruitment and data collection. We met parents in person to communicate the project and obtain their informed consent. The French Ethics Committee Review Board approved the study (Agreement 2022-A02281-42) which was conducted according to the guidelines of the Declaration of Helsinki (World Health Organisation, 2008). Parents filled out a questionnaire to ensure that infants did not have any hearing, cognitive, or developmental disorders and that they were raised in a dominant French-speaking environment. Other metadata were gathered through this questionnaire: number of caregivers, musical practice of the caregiver(s), linguistic environment (which language(s) spoken around the child), and socio-economic status (SES) assessed via profession. Independently of their age at the inclusion date, we followed infants until 24 months of age when possible, or as long as possible otherwise. Twenty infants were involved, with a mean age at inclusion of 12 months (m = 360 days, sd = 132.5). Six additional babies were recruited but excluded from the analysis because parents did not provide enough recordings (<5). 3.2 Procedure As mentioned above, we collaborated with three daycare centers that became a hub for data collection. Once parents had given their informed consent, they were provided with the LENA materials: a recorder and a t-shirt with a frontal pocket. Each infant had one unique recorder that they kept until the end of data collection. Clothing size was adapted to infants and changed throughout the months when needed. To help parents get used to the LENA system, we gave them some oral instructions when possible so they could ask questions and we could make sure they understood everything. Additionally, all families were given an instruction sheet that was taken from LENA’s support materials and adapted to our study. Instructions comprised information about when and how often to record, how to use the device, various recommendations, and the procedure for device deposit and pickup at daycare. Parents also had our contact information and could reach us whenever they needed. Parents were asked to have their child wear the recorder once a week for a full day, preferentially at home or during the weekends. To limit attrition, we accepted recordings at daycare occasionally, when they could not record another day or if they forgot.",
        "The frequency of the recordings was hard to maintain for some families, so we had to send them kind reminders sometimes. But overall, all families were very involved and consistent. We recommended that during a recording day, they never turn the recorder off, limit noisy environ134 ments, and let the recorder nearby while showering and during bedtimes. Once the recording was completed, they were asked to bring the LENA recorders back to the daycare center once a week. Then, the investigator could transfer the data to the database the same day, so parents could get the recorder back and start over for a new week. At the end of data collection (when the child reached 24 months or when families decided to stop), infants were given a \"baby researcher\" diploma and a customized t-shirt as a reward. 4 Tools and Methods Daylong recordings present a set of challenges in terms of processing. The first constraint is the data set size: we gathered 104 hours of highly heterogeneous recordings (both across and within recordings) that need to be sampled. Existing literature has used the notion of hot spots (areas in the recordings with a high density of speech events) as well as a method consisting of human labeling of extremely short sound events (Semenzin et al., 2021). Due to the required infrastructure, the latter approach was not considered for our work. Instead, we applied state-of-the-art computational techniques and packages to perform step-by-step reliability tests and calculate agreement scores between them. The automatic tools we used for our analyses are the LENA suite (Gilkerson and Richards, 2008) and a set of tools developed or adapted whithin the framework of ChildProject (Lavechin et al., 2020). 4.1 LENA We used the LENA system for both data collection and analysis. For data collection, LENA provides a small digital language processor (DLP) that is easily held in a child’s hand and can be directly inserted into child-adapted clothing equipped with a specific pocket on the front. The DLP can save up to 16 hours of auditory input. Recordings are then processed with the LENA software, which provides automatic annotations and quantification reports. The annotation process starts by segmenting the continuous audio recordings based on acoustic features such as intensity and pitch. The segments are then compared to general models of eight categories (Christakis et al., 2009) to be labeled as target child (CHN), adult male (MAN), adult female (FAN), other child (CXN), TV/electronic sounds (TVN), noise (NOI), silence (SIL), or overlapping sounds (OVL). Next, the four categories CHN, MAN, FAN, and CXN are further analyzed to differentiate speech-related from non-speech vocalizations (see Figure 17). The LENA software provides estimations of the number of words produced by adults (AWC) and infants’ speech-related vocalizations (CVC). In this study, we only used the raw sound event segmentation (timestamps) and labeling.",
        "4.2 VTC and VCM The ChildProject suite starts processing recordings with the voice-type-classifier (VTC) (Lavechin et al., 2020), which relies on the state-of-the-art speech diarization tool, pyannote (Bredin et al., 2020). VTC identifies sound activity segments that can be mapped to some of LENA’s categories: target key child (KCHI), other children (CHI), female (FEM), and male (MAL). Another tool, VoCalisation Maturity analysis (VCM) (Al Futaisi et al., 2019), refines the output of VTC. VCM is grounded on the state-of-the-art signal processing and emotion recognition tool, SMILE (Eyben et al., 2010), and more precisely on the Geneva Minimal Acoustic Parameter Set (GeMAPS) (Eyben et al., 2015). It adds information to the labeled categories (e.g., speech from the target child) by determining whether the targeted speech is Canonical (CNS), Non-canonical (NCS), cries (CRY), or other sounds (noise, laughter). Such classification has been used in (Casillas et al., 2017), for example. 5 Data set The corpus currently consists of 8286 hours of LENA daylong recordings. Table 1 indicates the mean, minimum, and maximum values for the recording period (age span), number of recording sessions, and length of the recordings. Avg Min Max Sum Age span (months) 9.85 3 18 - # sessions 27.0 6 66 540 Duration (hours) 414 87 1022 8286 Table 1: The data set. N = 20 children. Age span: number of months between the first and the last recording. Table 1 reflects a high variability in parents’ use of the LENA device. As mentioned earlier, we asked them to turn the DLP on in the morning and leave it until it automatically turns off after 16 hours of recording. However, some families turned 135 the device on and off multiple times during the day or stopped the recording before reaching 16 hours. Thus, we observed variability across participants in recording length and number. Additionally, there was variability in the recording span: not all children started the recordings at the same age, and not all were followed until 24 months of age. Given these observations, we selected a sample of children that 1) had at least 9 months of recording span and 2) provided at least 10 recordings. These thresholds allowed us to focus on more representative datasets while maintaining a sufficient number of data points to observe developmental trajectories. A sample of 10 children met these two criteria and were selected for complementary analyses (see Table 2). Avg Min Max Sum Age span (months) 14.2 10 18 - # sessions 40.9 12 66 409 Duration (hours) 637 192 1022 6366 Table 2: Selected children for individual longitudinal metrics and plots. N = 10 children (age recording span ≥9 months; number of recordings ≥10). 6 Investigating the data set 6.1 Testing age Our first goal was to test the reliability of the metrics extracted with the three targeted tools (LENA, VTC, VCM) on our data. A crucial check for our dataset consisted of testing whether children’s production evolved with age.",
        "We expected an increase in children’s speech-related metrics (such as speaking time and ratio, vocalization counts, etc.), while adults’ metrics would remain stable. Finally, the voices of other children present in the recordings were expected to increase as the siblings of the target child followed their own development. We began by examining the production time ratio (the percentage of the recording time occupied by a given category), for example, for the target child as shown in Figure 1 (See Appendix D for other categories). More precisely, we examined the production ratio calculated from LENA (sum of the duration of intervals labeled with CHN as the speaker, divided by recording duration), VTC (using the same approach with the label KCHI), as well as the correlation between the two measures. Importantly, the ratios obtained for the different voices from these two tools were highly correlated. More generally, all the metrics extracted with both approaches were highly correlated for all comparable categories. We tested whether age remained a dominant factor when controlling for the available metadata. In Figure 2, we plot the production ratio alongside gender, socio-economic status (high vs. low), and linguistic context (monolingual vs. plurilingual). From these figures, a general observation is that children’s speaking ratio increased with age. This was tested by conducting a linear mixed model analysis using pymer4 (Jolly, 2018). We treated ’target child speaking ratio’ as the dependent variable and ’age’ as the fixed effect, with ’child ID’ as the random effect. Only ’age’ had a significant effect on the target child production ratio (β = 0.261, SE = 0.028, and p < 0.001), controlling for ’gender’, ’linguistic environment’, and ’socio-economic status’ (all not significant). VCM metrics allowed us to refine our evaluation of child production with age. We applied it to our set of selected children and found (Figure 3) that the increase in speaking ratio was due to an increase in real child speech (both canonical and non-canonical) rather than to a variation in the proportion of cries, laughter, or noise. In addition, we replicated findings from Warlaumont et al. (2014), who tested the evolution of speech-related vocalization ratio (versus non-speech-related) produced by the target child. Using our own pipeline and analysis, we also found a significant increase in this ratio with age while controlling for all metadata (β = 0.219, SE = 0.022, p < 0.001) (See Appendix C.1). 6.2 Interactional metrics Conversations arguably constitute the most important aspect of the linguistic environment. First, we approached this by examining temporal contingencies (Bloom et al., 1987; Warlaumont et al.,"
      ]
    },
    {
      "section": "2014) between the child and the other voices in the",
      "chunks": [
        "recordings. Specifically, we analyzed instances of target child productions followed by another participant, as well as target child productions preceded by other participants. Working with manually transcribed data, Nikolaus et al. (2022) explored the effect of time-contingent responses on children’s intelligibility. These studies found that (1) caregivers provided more time-contingent responses to intelligible utterances from the child and (2) children 136 (a) LENA (b) VTC (c) Correlation (r = 0.862) Figure 1: Target Child Speaking Time Ratio for (a) LENA (controlled for child id, β = 0.159; SE = 0.027; p < 0.001); (b) VTC (β = 0.242; SE = 0.029; p < 0.001) and (c) correlation plot between LENA and VTC. All children included (n=20). Age in days. (a) Gender (b) Socio Economic Status (c) Linguistic Context Figure 2: Target child Production Time (from LENA) differentiating for (a) gender ; (b) socio-economic status ; (c) linguistic background. Only age is significant. The three other variables are not. See Appendix D for details. Selected children. Age in days. produced more intelligible utterances if their caregivers were responsive. Then, we investigated the \"social feedback loop\" as proposed by Warlaumont et al. (2014). We employed a similar approach for both tools at our disposal. For CHILD>ADULT contingencies, we selected all target child productions and checked whether there was a production from an adult (MAL + FEM) participant 1 second after. While LENA metrics extract similar information, we aimed to use the same method for both tools to enable a direct comparison. Figure 4 depicts the comparison for CHILD>ADULT contingencies. We also looked at ANY>CHILD contingencies by considering any activity occurring 2 seconds before1 before a child production. Figure 5 1We considered allowing for a longer gap for children’s follow-up to be appropriate. To count \"turns\", LENA metrics use a 5-second threshold. provides the VTC extraction for ANY>CHILD contingencies (additional combinations are included in Appendix E). We tested, for VTC data, the relationship between age and temporal contingencies for CHILD>ADULT (β = 0.326, SE = 0.026, p < 0.001) and ANY>CHILD (β = 0.158, SE = 0.030, p < 0.001), while controlling for gender, linguistic environment, and socio-economic status. This result was further refined by replicating the second finding from Warlaumont et al. (2014) on our dataset (and with LENA metrics this time). Specifically, we confirmed that children’s speech-related productions tend to elicit more feedback from adults (See Appendix C.2). Finally, we also replicated Warlaumont’s result about the social loop on our data. We tested whether initial speech-related CHILD productions 137 Figure 3: Speech vs.",
        "Non-speech VCM extraction for the selected children. that were followed by an ADULT production 1 second after2 were more likely to be followed by a speech-related CHILD production than a nonspeech CHILD production within 3.5 seconds, compared to initial speech-related CHILD productions that did not receive an adult response.3 This is illustrated in Figure 6, which shows the difference in speech-related / non-speech related ratio in child’s production after an adult’s response versus no response. This difference is positive, indicating that adult responses to children’s speech-related productions tend to increase the proportion of child speech-related follow-ups. 7"
      ]
    },
    {
      "section": "Discussion",
      "chunks": [
        "The collection and investigation of our original corpus in French households facilitated the comparison of different analysis tools and the replication of previous results within the same age ranges. First, we identified a robust relationship between target child production metrics and age. As expected, we did not observe a similar significant 2Following Warlaumont et al. (2014) and Nikolaus et al. (2022), who followed Oller et al. (2010), which used a 1second window to extract relevant vocal activity to investigate the \"social feedback loop\" for children between 8 to 48 months. 3This 3.5 second is between the end of initial CHILD production and the start of the following one. The delay is to allow for a potential ADULT response to occur in between. It is not possible to use the ADULT production for proposing a simpler time threshold for the following utterance since there is not always an ADULT production in-between. change for adult voices. However, the evolution was also positive and significant for other children’s voices (β = 0.179, SE = 0.027, p < 0.001). This can be attributed to the behavioral path of siblings as well as other children in kindergartens. All these results were obtained using both LENA and VTC pipelines. Finally, we found coherent results in line with existing literature and across the tools we used. These results strengthen our confidence in both our recording protocol and in the metrics extraction and analysis. These comments hold for interactional metrics as well: the increases in temporal contingencies involving the children were consistent with findings from previous studies (Warlaumont et al., 2014; Nikolaus et al., 2022). We calculated temporal contingencies in a way that ensured these increases were not influenced by the overall amount of child productions. Furthermore, our more detailed analysis (depicted in Figure 3) and the replication of Warlaumont’s first results, showed that the increase in child’s productions with age was due to speechrelated productions and not to vegetative sounds or noise. In summary, our data show that children do produce more speech while growing up in their first two years of life. These increased productions are temporally contingent on other speakers, regardless of the initiator of the interaction (target child or other speaker). This is further elaborated by the replication of Warlaumont’s third result about the social loop that showed the benefit of follow-up productions of adult feedback on children’s speech. Contrary to Warlaumont et al. (2014) (but in line with Bergelson et al. (2023) we did not find any effect of parental SES, gender, or linguistic environment on children’s productions. This was the same for temporal contingencies used as a proxy for measuring linguistic interaction with the child. Other studies have attempted to dive further into linguistic metrics from large child-caregiver datasets.",
        "Some refined the speech contingencies to distinguish corrective feedback or to approach the grammaticality evaluation of the productions in these datasets (Nikolaus et al., 2023). However, those datasets have been manually transcribed, while ours did not (and will not) receive such a transcription. A second major difference is the age range of the children. Most of the existing studies involved children from 12-24 months up to 138 (a) LENA (b) VTC (c) Correlation (r = 0.831 Figure 4: CHILD>ADULT contingencies for (a) LENA (β = 0.131; SE = 0.024; p < 0.001), (b) VTC (β = 0.130, SE = 0.024, p < 0.001) and (c) correlation plot. Selected children. Age in days. Figure 5: ANY>CHILD contingencies from VTC speech extraction. (β = 0.158, SE = 0.030, p < 0.001) later ages. This inevitably changes the nature and characteristics of the metrics that can be extracted. Another trend of work focuses on phonetic learning based on daylong recordings, such as Lavechin et al. (2024) on perceptual attunement. Finally, in a more cultural and typological direction, Bergelson et al. (2023) studied a global sample of 1,001 childcentered audio capturing 2- to 48-months-olds from many countries and various cultural backgrounds. 8"
      ]
    },
    {
      "section": "Conclusion",
      "chunks": [
        "This work first constitutes a replication of earlier results on daylong recordings, on a completely new and independent data set, using two different tools. This contributes to answer Cruz Blandón et al. (2023)’s call for more and better meta-studies on long recordings. Indeed, despite their creation cost, daylong recordings’ significance is growing Figure 6: Child ratio difference between Child speech and non-speech productions depending on whether or not an initial child speech-related utterance was responded by an adult or not (positive mean : indicating a tendency for more speech-related responses), replication of Warlaumont et al. (2014). in cognitive science. Showing that these data sets, despite their noisy nature, do present enough reliability to gain insights about the children’s language and communicative skills development is crucial. The second contribution consists of the characterization of our data set itself. It is a large data set (>8000 hours of recordings) that is still growing at the time of writing. It is unique by being truly longitudinal with some children’s environments being recorded over a two-year span. Finally, other experimental data were collected longitudinally in the same sample of infants. These are beyond the scope of this paper but open up the possibilities of cross-analyses between the characterization of 139 the linguistic environment and other experimental results regarding language development. The present study, therefore, constitutes a crucial first step in this direction through the thorough exploration of the data set, and by considering individual variability. From here, we now plan to refine the analyses by entering into more linguistic characterizations of these productions in terms of richness. We will consider tools that allow for more phonological measures such as Räsänen et al. (2021) and more content-based metrics (Nikolaus et al., 2023, 2024) that have been used so far only on transcript-based corpora from CHILDES (MacWhinney, 2000) and that can be now explored on daylong recordings thanks to the improvement of automatic speech recognition engines."
      ]
    },
      {
      "section": "Limitations",
      "chunks": [
        "One major limitation of this work is the absence of manual annotation. For legal and ethical reasons, we are not in position to perform extensive manual annotations of raw audio data, as well as sharing raw audio. We needed to find other ways to check the reliability of our dataset. By replicating previous results from the literature and comparing different computational tools, we reinforced our trust in our dataset and overcame this constraint. All metrics derived from the corpus related to this paper as well as for future work will be made available in the LLDC public repository on Ortolang institutional platform https://www.ortolang.fr/. Moreover the code for producing the analyses presented in this paper is available at : https: //github.com/prevotlaurent/LENA_CMCL."
      ]
    },
    {
      "section": "Acknowledgments",
      "chunks": [
        "We thank all the babies and their families for participating in the study. We also thank the directors and the staff of the Babilou daycare centers where the babies were evaluated. We thank Mathilde Gaujard for her help in the recruitment and data collection. This research has been supported by an ANR grant (“BabyLang project”, ANR-20-CE280017) to CF and a CNRS 80PRIME grant to CF and LP (“LangDev project”). This work, carried out within the Institut Convergence ILCB (ANR16-CONV-0002), has benefited from support from the French government, managed by the French National Agency for Research (ANR) and the Excellence Initiative of Aix-Marseille University (A*MIDEX)."
      ]
    }
  ]
}